---
kind: method
id: M:Autodesk.Revit.DB.ViewCropRegionShapeManager.Dispose
source: html/7c0d13f8-0263-d113-c4cf-20cb62693001.htm
---
# Autodesk.Revit.DB.ViewCropRegionShapeManager.Dispose Method

Releases all resources used by the ViewCropRegionShapeManager

## Syntax (C#)
```csharp
public void Dispose()
```